#### Terraform Apply 🚀`success`
<details><summary>Show Apply</summary>

```

module.azure_bot.time_rotating.example: Refreshing state... [id=2023-11-24T05:24:15Z]
module.azure_bot.azuread_application.application: Refreshing state... [id=/applications/8102f76f-6fed-4fed-9a62-ddeff46d05dc]
azuread_application.example: Refreshing state... [id=/applications/1d9507e2-cb49-4bf8-ab3a-18dc65565355]
module.azure_bot.azuread_application_password.example: Refreshing state... [id=8102f76f-6fed-4fed-9a62-ddeff46d05dc/password/75c5644f-f001-407a-ae99-89cd0194aa96]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev/providers/Microsoft.BotService/botServices/koichi-furukawa-example-1-bot-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.azure_bot.azuread_application.application will be updated in-place
  ~ resource "azuread_application" "application" {
      ~ display_name                   = "koichi-furukawa-example-1-dev" -> "koichi-furukawa-example-2-dev"
        id                             = "/applications/8102f76f-6fed-4fed-9a62-ddeff46d05dc"
        tags                           = []
        # (15 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.azure_bot.azuread_application_password.example must be replaced
-/+ resource "azuread_application_password" "example" {
      ~ application_object_id = "8102f76f-6fed-4fed-9a62-ddeff46d05dc" -> (known after apply)
      ~ display_name          = "koichi-furukawa-example-1-dev-client-secret" -> "koichi-furukawa-example-2-dev-client-secret" # forces replacement
      ~ end_date              = "2025-11-24T05:24:16Z" -> (known after apply)
      ~ id                    = "8102f76f-6fed-4fed-9a62-ddeff46d05dc/password/75c5644f-f001-407a-ae99-89cd0194aa96" -> (known after apply)
      ~ key_id                = "75c5644f-f001-407a-ae99-89cd0194aa96" -> (known after apply)
      ~ start_date            = "2023-11-24T05:24:16Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # module.azure_bot.azurerm_bot_service_azure_bot.azure_bot must be replaced
-/+ resource "azurerm_bot_service_azure_bot" "azure_bot" {
      ~ display_name                 = "koichi-furukawa-example-1-bot-dev" -> (known after apply)
      ~ id                           = "/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev/providers/Microsoft.BotService/botServices/koichi-furukawa-example-1-bot-dev" -> (known after apply)
      - luis_app_ids                 = [] -> null
      ~ name                         = "koichi-furukawa-example-1-bot-dev" -> "koichi-furukawa-example-2-bot-dev" # forces replacement
      ~ resource_group_name          = "koichi-furukawa-example-1-rg-dev" -> "koichi-furukawa-example-2-rg-dev" # forces replacement
      - tags                         = {} -> null
        # (7 unchanged attributes hidden)
    }

  # module.azure_bot.azurerm_resource_group.azure_bot_rg must be replaced
-/+ resource "azurerm_resource_group" "azure_bot_rg" {
      ~ id       = "/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev" -> (known after apply)
      ~ name     = "koichi-furukawa-example-1-rg-dev" -> "koichi-furukawa-example-2-rg-dev" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
module.azure_bot.azuread_application_password.example: Destroying... [id=8102f76f-6fed-4fed-9a62-ddeff46d05dc/password/75c5644f-f001-407a-ae99-89cd0194aa96]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev/providers/Microsoft.BotService/botServices/koichi-furukawa-example-1-bot-dev]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Destruction complete after 3s
module.azure_bot.azurerm_resource_group.azure_bot_rg: Destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev]
module.azure_bot.azuread_application_password.example: Still destroying... [id=8102f76f-6fed-4fed-9a62-ddeff46d05dc/pa...d/75c5644f-f001-407a-ae99-89cd0194aa96, 10s elapsed]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Still destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-...roups/koichi-furukawa-example-1-rg-dev, 10s elapsed]
module.azure_bot.azuread_application_password.example: Still destroying... [id=8102f76f-6fed-4fed-9a62-ddeff46d05dc/pa...d/75c5644f-f001-407a-ae99-89cd0194aa96, 20s elapsed]
module.azure_bot.azuread_application_password.example: Destruction complete after 23s
module.azure_bot.azuread_application.application: Modifying... [id=/applications/8102f76f-6fed-4fed-9a62-ddeff46d05dc]
module.azure_bot.azuread_application.application: Modifications complete after 1s [id=/applications/8102f76f-6fed-4fed-9a62-ddeff46d05dc]
module.azure_bot.azuread_application_password.example: Creating...
module.azure_bot.azurerm_resource_group.azure_bot_rg: Still destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-...roups/koichi-furukawa-example-1-rg-dev, 20s elapsed]
module.azure_bot.azuread_application_password.example: Creation complete after 7s [id=8102f76f-6fed-4fed-9a62-ddeff46d05dc/password/5c776384-2db7-4f71-b6a3-2386ce7d9985]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Still destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-...roups/koichi-furukawa-example-1-rg-dev, 30s elapsed]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Still destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-...roups/koichi-furukawa-example-1-rg-dev, 40s elapsed]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Still destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-...roups/koichi-furukawa-example-1-rg-dev, 50s elapsed]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Still destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-...roups/koichi-furukawa-example-1-rg-dev, 1m0s elapsed]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Still destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-...roups/koichi-furukawa-example-1-rg-dev, 1m10s elapsed]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Still destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-...roups/koichi-furukawa-example-1-rg-dev, 1m20s elapsed]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Destruction complete after 1m24s
module.azure_bot.azurerm_resource_group.azure_bot_rg: Creating...
module.azure_bot.azurerm_resource_group.azure_bot_rg: Creation complete after 3s [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-2-rg-dev]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Creating...
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Creation complete after 10s [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-2-rg-dev/providers/Microsoft.BotService/botServices/koichi-furukawa-example-2-bot-dev]

Apply complete! Resources: 3 added, 1 changed, 3 destroyed.

```

</details>

*Pusher: @kooooichi24, Action: `push`, Working Directory: ``, Workflow: `Terraform Apply`*